# Data Cleaning and Preparation

In [1]:
import numpy as np
import pandas as pd
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [2]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0] = None
print(string_data)

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## Filtering Out Missing Data

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], 
                     [1., NA, NA],
                     [NA, NA, NA], 
                     [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
cleaned_how = data.dropna(how='all')
cleaned_how

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [14]:
data[2]

0    3.0
1    NaN
2    NaN
3    3.0
Name: 2, dtype: float64

In [15]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  2.848065 -0.237881 -0.503382
1  0.408163  0.638490 -1.243054
2  2.998646  1.764806 -1.110649
3  0.537995 -0.283477 -0.312007
4  1.407725 -0.122242 -0.287893
5  0.056636  1.507476 -0.632404
6  0.385423 -0.596959 -0.307750

In [16]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [17]:
df

          0         1         2
0  2.848065       NaN       NaN
1  0.408163       NaN       NaN
2  2.998646       NaN -1.110649
3  0.537995       NaN -0.312007
4  1.407725 -0.122242 -0.287893
5  0.056636  1.507476 -0.632404
6  0.385423 -0.596959 -0.307750

In [18]:
df.dropna()

          0         1         2
4  1.407725 -0.122242 -0.287893
5  0.056636  1.507476 -0.632404
6  0.385423 -0.596959 -0.307750

In [19]:
df.dropna(thresh=4, axis=1)

          0         2
0  2.848065       NaN
1  0.408163       NaN
2  2.998646 -1.110649
3  0.537995 -0.312007
4  1.407725 -0.287893
5  0.056636 -0.632404
6  0.385423 -0.307750

## Filling In Missing Data

In [20]:
import pandas as pd

In [21]:
df.fillna(0)

          0         1         2
0  2.848065  0.000000  0.000000
1  0.408163  0.000000  0.000000
2  2.998646  0.000000 -1.110649
3  0.537995  0.000000 -0.312007
4  1.407725 -0.122242 -0.287893
5  0.056636  1.507476 -0.632404
6  0.385423 -0.596959 -0.307750

In [22]:
df

          0         1         2
0  2.848065       NaN       NaN
1  0.408163       NaN       NaN
2  2.998646       NaN -1.110649
3  0.537995       NaN -0.312007
4  1.407725 -0.122242 -0.287893
5  0.056636  1.507476 -0.632404
6  0.385423 -0.596959 -0.307750

In [23]:
df.fillna({1:0.5,2:2})

          0         1         2
0  2.848065  0.500000  2.000000
1  0.408163  0.500000  2.000000
2  2.998646  0.500000 -1.110649
3  0.537995  0.500000 -0.312007
4  1.407725 -0.122242 -0.287893
5  0.056636  1.507476 -0.632404
6  0.385423 -0.596959 -0.307750

In [24]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  2.848065  0.000000  0.000000
1  0.408163  0.000000  0.000000
2  2.998646  0.000000 -1.110649
3  0.537995  0.000000 -0.312007
4  1.407725 -0.122242 -0.287893
5  0.056636  1.507476 -0.632404
6  0.385423 -0.596959 -0.307750

In [25]:
l2 = [3,4,5]
v1, _ , v3 = l2

In [26]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[3:5, 2] = NA
df

          0         1         2
0 -1.037864 -0.573614  1.189167
1  0.044112  1.860638  1.036306
2 -0.524699       NaN  0.284931
3 -0.520299       NaN       NaN
4  1.096588       NaN       NaN
5 -1.442985       NaN -1.268115

In [27]:
df.fillna(method='ffill')

          0         1         2
0 -1.037864 -0.573614  1.189167
1  0.044112  1.860638  1.036306
2 -0.524699  1.860638  0.284931
3 -0.520299  1.860638  0.284931
4  1.096588  1.860638  0.284931
5 -1.442985  1.860638 -1.268115

In [28]:
df.fillna(method='bfill')

          0         1         2
0 -1.037864 -0.573614  1.189167
1  0.044112  1.860638  1.036306
2 -0.524699       NaN  0.284931
3 -0.520299       NaN -1.268115
4  1.096588       NaN -1.268115
5 -1.442985       NaN -1.268115

In [29]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -1.037864 -0.573614  1.189167
1  0.044112  1.860638  1.036306
2 -0.524699  1.860638  0.284931
3 -0.520299  1.860638  0.284931
4  1.096588       NaN  0.284931
5 -1.442985       NaN -1.268115

In [30]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [31]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

In [32]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [35]:
data['v1'] = range(7)

In [36]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [37]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [38]:
data.drop_duplicates(['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [39]:
data.drop_duplicates(['k1'],keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [40]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [41]:
lowercase = data['food'].str.lower()
lowercase

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [42]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [43]:
data['animal'] = lowercase.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [45]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [46]:
import numpy as np
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [47]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [48]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [49]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
import numpy as np
import pandas as pd

In [51]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [52]:
transform = lambda x: x[:4].upper()

In [53]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [54]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [55]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [56]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [57]:
data.rename(index={'OHIO':'dublin'},columns = {'three':'peekaboo'})

        one  two  peekaboo  four
dublin    0    1         2     3
COLO      4    5         6     7
NEW       8    9        10    11

In [58]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# Discretization and Binning

In [59]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [60]:
bins = [18, 25, 35, 60, 100]

In [61]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [62]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [63]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [64]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [65]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [66]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [67]:
data = np.random.rand(20)
data

array([0.57276878, 0.07425482, 0.46939375, 0.55206797, 0.4688583 ,
       0.41586645, 0.41157338, 0.36992582, 0.71593074, 0.25160695,
       0.96327091, 0.22493952, 0.38918964, 0.94117321, 0.84025735,
       0.91325962, 0.16480009, 0.24030491, 0.2623291 , 0.825747  ])

In [68]:
cats = pd.cut(data, 4, precision=2)
cats

[(0.52, 0.74], (0.073, 0.3], (0.3, 0.52], (0.52, 0.74], (0.3, 0.52], ..., (0.74, 0.96], (0.073, 0.3], (0.073, 0.3], (0.073, 0.3], (0.74, 0.96]]
Length: 20
Categories (4, interval[float64]): [(0.073, 0.3] < (0.3, 0.52] < (0.52, 0.74] < (0.74, 0.96]]

In [69]:
pd.value_counts(cats)

(0.3, 0.52]     6
(0.073, 0.3]    6
(0.74, 0.96]    5
(0.52, 0.74]    3
dtype: int64

In [70]:
data = np.random.randn(1000)
data[:10]

array([-0.94276644,  2.21562985,  1.4077068 , -0.17745233, -1.45738881,
        0.47380082,  1.23274182,  0.8364028 , -0.35008261,  0.55386693])

In [71]:
cats = pd.qcut(data,4)

In [72]:
cats

[(-2.7649999999999997, -0.623], (0.717, 3.237], (0.717, 3.237], (-0.623, 0.00624], (-2.7649999999999997, -0.623], ..., (-2.7649999999999997, -0.623], (0.717, 3.237], (0.717, 3.237], (-2.7649999999999997, -0.623], (0.717, 3.237]]
Length: 1000
Categories (4, interval[float64]): [(-2.7649999999999997, -0.623] < (-0.623, 0.00624] < (0.00624, 0.717] < (0.717, 3.237]]

In [73]:
pd.value_counts(cats)

(0.717, 3.237]                   250
(0.00624, 0.717]                 250
(-0.623, 0.00624]                250
(-2.7649999999999997, -0.623]    250
dtype: int64

In [74]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.167, 0.00624], (1.297, 3.237], (1.297, 3.237], (-1.167, 0.00624], (-2.7649999999999997, -1.167], ..., (-1.167, 0.00624], (1.297, 3.237], (0.00624, 1.297], (-1.167, 0.00624], (0.00624, 1.297]]
Length: 1000
Categories (4, interval[float64]): [(-2.7649999999999997, -1.167] < (-1.167, 0.00624] < (0.00624, 1.297] < (1.297, 3.237]]

# Detecting and Filtering Outliers

In [75]:
import pandas as pd
import numpy as np
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.025891     0.048186     0.012708     0.024942
std       1.012768     1.010853     0.979569     1.014005
min      -3.111494    -2.987811    -2.892492    -2.742410
25%      -0.663250    -0.640977    -0.690354    -0.667426
50%      -0.007267     0.037165    -0.016331     0.032625
75%       0.638878     0.765437     0.661567     0.720229
max       3.163805     2.889223     3.389554     2.984774

In [76]:
col = data[2]

In [77]:
col[np.abs(col)>2]

4      2.332231
7      2.042048
18    -2.047676
71    -2.209039
86     2.348078
124    2.225468
169   -2.602759
180    2.065940
220   -2.008055
225    2.136360
261   -2.193917
272   -2.107108
373    2.062415
396   -2.003041
400    2.315919
432    2.320406
466    2.126711
473   -2.516273
476    3.017661
509   -2.220639
545    2.278648
603    2.258522
617    2.109364
633   -2.004987
652   -2.331039
667    2.590011
678    2.143526
742    2.529493
753    2.858686
803    2.096686
804    2.041149
810   -2.035087
821   -2.188522
827    2.368998
885    2.884794
898   -2.892492
906    3.124389
947    2.399140
955   -2.291897
956    2.529339
983    3.389554
Name: 2, dtype: float64

In [78]:
data[(np.abs(data)>3)]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [79]:
data[(np.abs(data)>3)][22:23]

     0   1   2   3
22 NaN NaN NaN NaN

In [80]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
252 -3.111494 -0.023709  0.037175 -0.573339
476 -1.337508  1.073196  3.017661  1.056088
869  3.163805  0.762856 -0.119315  1.160532
906 -0.404104  0.420490  3.124389 -0.324667
983  0.328307  1.378376  3.389554  0.397019

In [81]:
np.sign(data) * 3

       0    1    2    3
0    3.0  3.0 -3.0  3.0
1   -3.0 -3.0 -3.0  3.0
2   -3.0  3.0 -3.0 -3.0
3   -3.0 -3.0 -3.0  3.0
4    3.0  3.0  3.0  3.0
..   ...  ...  ...  ...
995 -3.0 -3.0 -3.0 -3.0
996  3.0  3.0  3.0 -3.0
997  3.0 -3.0  3.0 -3.0
998 -3.0  3.0  3.0  3.0
999 -3.0  3.0 -3.0  3.0

[1000 rows x 4 columns]

In [82]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.head()

          0         1         2         3
0  1.912644  0.475709 -1.002837  0.199257
1 -0.529185 -0.199758 -0.456535  0.061717
2 -0.484674  1.940279 -1.223590 -1.340814
3 -0.171708 -0.472812 -0.589558  0.727151
4  0.160682  2.508082  2.332231  2.352980

In [83]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.025943     0.048186     0.012176     0.024942
std       1.011931     1.010853     0.977859     1.014005
min      -3.000000    -2.987811    -2.892492    -2.742410
25%      -0.663250    -0.640977    -0.690354    -0.667426
50%      -0.007267     0.037165    -0.016331     0.032625
75%       0.638878     0.765437     0.661567     0.720229
max       3.000000     2.889223     3.000000     2.984774

In [84]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1 -1.0 -1.0 -1.0  1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0  1.0  1.0  1.0

In [85]:
data.head()

          0         1         2         3
0  1.912644  0.475709 -1.002837  0.199257
1 -0.529185 -0.199758 -0.456535  0.061717
2 -0.484674  1.940279 -1.223590 -1.340814
3 -0.171708 -0.472812 -0.589558  0.727151
4  0.160682  2.508082  2.332231  2.352980

In [86]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [87]:
sampler = np.random.permutation(5)
sampler

array([1, 3, 0, 4, 2])

In [88]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [89]:
df.sample(3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11

In [90]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [91]:
draws = choices.sample(10,replace=True)
draws

3    6
1    7
2   -1
2   -1
1    7
3    6
0    5
2   -1
2   -1
0    5
dtype: int64

# Computing Indicator/Dummy Variables

In [92]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [93]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [94]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [95]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [96]:
mnames = ['movie_id', 'title', 'genres']

In [97]:
movies = pd.read_table('movies.dat', sep='::',
header=None, names=mnames)

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

FileNotFoundError: [Errno 2] No such file or directory: 'movies.dat'

In [98]:
movies[:10]

NameError: name 'movies' is not defined

In [99]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

NameError: name 'movies' is not defined

In [100]:
zero_matrix = np.zeros((len(movies),len(genres)))

NameError: name 'movies' is not defined

In [101]:
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies.head()

NameError: name 'zero_matrix' is not defined

In [102]:
gen  = movies.genres[0]
gen.split('|')

NameError: name 'movies' is not defined

In [103]:
dummies.columns.get_indexer(gen.split('|'))

NameError: name 'gen' is not defined

In [104]:
len(movies.genres)

NameError: name 'movies' is not defined

In [105]:
for i , gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1

NameError: name 'movies' is not defined

In [106]:
dummies.head()

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0

In [107]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

NameError: name 'movies' is not defined

In [108]:
movies_windic[0:5]

NameError: name 'movies_windic' is not defined

In [109]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [110]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [111]:
pd.cut(values, bins)

[(0.8, 1.0], (0.2, 0.4], (0.0, 0.2], (0.2, 0.4], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0], (0.6, 0.8], (0.6, 0.8], (0.6, 0.8]]
Categories (5, interval[float64]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [112]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# String Manipulation

In [113]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [114]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [115]:
import numpy as np
import pandas as pd

In [116]:
first,second, third = pieces

In [117]:
first + '::' + second + '::' + third

'a::b::guido'

In [118]:
first + ',' + second + '::' + third

'a,b::guido'

In [119]:
'::'.join(pieces)

'a::b::guido'

In [120]:
'guido' in val

True

In [121]:
val.index(',')

1

In [122]:
val.find(':')

-1

In [123]:
val.count(',')

2

In [124]:
val.replace(',',"::")

'a::b:: guido'

In [125]:
val.replace(',','')

'ab guido'

In [126]:
import re
text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [127]:
regex = re.compile('\s+')

In [128]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [129]:
regex.findall(text)

[' ', '\t ', ' \t']

In [130]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [131]:
regex.split(text)

['Dave ', '\nSteve ', '\nRob ', '\nRyan ', '\n']

In [132]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [133]:
m = regex.search(text)
m

In [134]:
text[m.start():m.end()]

'dave@google.com'

In [135]:
# regex.match returns None, as it only will match if the pattern occurs at the start of the
# string:
print(regex.match(text))

None

In [136]:
# Relatedly, sub will return a new string with occurrences of the pattern replaced by the
# a new string:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [137]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [138]:
m = regex.match('wesm@bright.net')
m

In [139]:
m.groups()

('wesm', 'bright', 'net')

In [140]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [141]:
print(regex.sub(r'Username:\1, Domain:\2, Suffix:\3',text))

Dave Username:dave, Domain:google, Suffix:com
Steve Username:steve, Domain:gmail, Suffix:com
Rob Username:rob, Domain:gmail, Suffix:com
Ryan Username:ryan, Domain:yahoo, Suffix:com

# Vectorized String Functions in pandas

In [142]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [143]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [144]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [145]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [146]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [147]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [148]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [149]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [150]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object